# FacetingUtils Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FacetingUtils Class
Members See Also
---
This class is used to convertTrianglesToQuads a triangulated structure into a structure in which some of the triangles have been consolidated into quadrilaterals.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public static class FacetingUtils
```

Visual Basic
---
```text
Public NotInheritable Class FacetingUtils
```

Visual C++
---
```text
public ref class FacetingUtils abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..FacetingUtils
# See Also
FacetingUtils Members
Autodesk.Revit.DB Namespace